app/views/posts/_post.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 21
---
    <div class="card-action">
      <%= post.likes.size %>명이 좋아합니다<br><br>