app/controllers/likes_controller.rb

SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 18 LIMIT 1
INSERT INTO `likes` (`user_id`, `post_id`, `created_at`, `updated_at`) VALUES (1, 18, '2018-07-14 13:24:39', '2018-07-14 13:24:39')
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
  def like_toggle
    like = Like.find_by(user_id: current_user.id,
      post_id: params[:post_id])

    if like.nil?
      Like.create(user_id: current_user.id,
        post_id: params[:post_id])
    else
      like.destroy