app/controllers/posts_controller.rb

  def edit
    @post = Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 17 LIMIT 1  [["id", 17], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('오늘따라 삼겹살이 땡기는 날이네요 같이 삼겹살 드실분>>????', 1, '2018-07-12 10:30:21', '2018-07-12 10:30:21', '유레카.jpg')